In [31]:
import pandas as pd
movie_data = pd.read_csv('./data/movies_data/movies.csv', sep=',')
rating1_data = pd.read_csv('./data/movies_data/ratings1.csv', sep=',')

rating2_data = pd.read_csv('./data/movies_data/ratings2.csv', sep=',')
date_data = pd.read_csv('./data/movies_data/dates.csv', sep=',')

In [32]:
movie_df = movie_data.copy()
rating1_df = rating1_data.copy()
rating2_df = rating2_data.copy()
date_df = date_data.copy()

In [33]:
movie_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [34]:
movie_df['movieId'].nunique()

9742

In [35]:
rating1_df['userId'].nunique()

274

In [36]:
date_df.head()

                  date
0  2000-07-30 18:45:03
1  2000-07-30 18:20:47
2  2000-07-30 18:37:04
3  2000-07-30 19:03:35
4  2000-07-30 18:48:51

In [37]:
date_df['date'] = pd.to_datetime(date_df['date'])

In [38]:
date_df['date'].groupby(by=(date_df['date'].dt.year)).count().sort_values(ascending=False)

date
2000    10061
2017     8198
2007     7114
2016     6703
2015     6616
2018     6418
1996     6040
2005     5813
2012     4656
2008     4351
2009     4158
2006     4059
2003     4014
2001     3922
2002     3478
2004     3279
1999     2439
2010     2301
1997     1916
2011     1690
2013     1664
2014     1439
1998      507
Name: date, dtype: int64

In [41]:
ratings = pd.concat([rating1_df, rating2_df], ignore_index = True)
display(ratings)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [42]:
print('Число строк в таблице ratings: ', ratings.shape[0])
print('Число строк в таблице dates: ', date_df.shape[0])
print(ratings.shape[0] == date_df.shape[0])

Число строк в таблице ratings:  100837
Число строк в таблице dates:  100836
False

In [48]:
ratings = ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', ratings.shape[0])

Число строк в таблице ratings:  100836

In [45]:
ratings_dates = pd.concat([ratings, date_df], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                date
100829     610   164179     5.0 2017-05-03 21:07:11
100830     610   166528     4.0 2017-05-04 06:29:25
100831     610   166534     4.0 2017-05-03 21:53:22
100832     610   168248     5.0 2017-05-03 22:21:31
100833     610   168250     5.0 2017-05-08 19:50:47
100834     610   168252     5.0 2017-05-03 21:19:12
100835     610   170875     3.0 2017-05-03 21:20:15

In [47]:
ldir = ['users2.csv', 'users1.csv', 'users3.csv']
ldir.sort()
display(ldir)

['users1.csv', 'users2.csv', 'users3.csv']